import random
# Вынес статичные масивы, что бы лишний раз не грузить в память
random_letter = ['а','в','е','к','м','н','о','р','с','т','у','х']
random_number = ['0','1','2','3','4','5','6','7','8','9']
random_code_region = ["01","02","102","702","03", "103","04","05","06","07","08","09", "109","10","11", "111","12","13", "113","14","15","16", "116", "716","17","18", "118","19","21", "121","22", "122","23", "93", "123", "193","24", "84", "88", "124","25", "125", "725","26", "126","27","28","29","30", "130","31","32","33","34", "134","35","36", "136","37","38", "138","39", "91", "139","40","41","42", "142","43","44","45","46","47", "147","48","49","50", "90", "150", "190", "250", "550", "750", "790","51","52", "152","53","54", "154", "754","55", "155","56", "156","57","58", "158","59", "81", "159","60","61", "161", "761","62","63", "163", "763","64", "164","65","66", "96", "196","67","68","69", "169","70","71","72", "172","73", "173","74", "174", "774","75","76","77", "97", "99", "177", "197", "199", "777", "797", "799", "977","78", "98", "178", "198","79","80", "180","81", "181","82","83","84", "184","85", "185","86", "186","87","88","89","92", "192","94","95","96","97","98","99"]
# Функция выполняет 1 простое действие, а не 10
def generation_auto_number():
    return random.choice(random_letter) + random.choice(random_number) + random.choice(random_number) +random.choice(random_number) + random.choice(random_letter) + random.choice(random_letter) +  random.choice(random_code_region)
# Срабатывает, только в том случии если запускают этот файл, при импорте этот код не будет работать.
if __name__ == '__main__':
    print("Вас приветствует генератор российского автомобильного номера.")
    while True:
        question = input("Для продолжения нажмите Enter или введите колличество номеров (Сохраняет в файл), для выхода - стоп: ")
        if question.lower() == "стоп":
            print("До свидания!")
            break
        elif question.isdigit() and int(question) > 0:
            auto_number = []
            for i in range(int(question)):
                auto_number.append(generation_auto_number())
                print(auto_number[-1])
            with open("auto_number.txt", "w", encoding="utf-8") as file:
                file.write("\n".join(auto_number))
        else:
            print(generation_auto_number())
